Revit 2027 API
ExternalResourceBrowserData.GetResources Method
 Gets the external resources under the folder path of the browser data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExternalResourceReference> GetResources()
Public Function GetResources As IList(Of ExternalResourceReference)
public:
IList<ExternalResourceReference^>^ GetResources()
member GetResources : unit -> IList<ExternalResourceReference>
Return Value
IList<ExternalResourceReference>
 The external resources under current folder of the browser data.
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace